1.bash

curl -i -s -k  -X 'POST' -H 'User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/72.0.3626.121 Safari/537.36' -H 'Content-Type: application/xml'-b 'ZM_ADMIN_AUTH_TOKEN=0_dde1d59fbf077c45205f89493fbd5ac6122ba9a5_69643d33363a65306661666438392d313336302d313164392d383636312d3030306139356439386566323b6578703d31333a313636343538363432303233333b747970653d363a7a696d6272613b753d313a613b7469643d393a3336363535303235363b76657273696f6e3d31343a382e382e31355f47415f333836393b'  --data-binary '<soap:Envelope xmlns:soap=\"http://www.w3.org/2003/05/soap-envelope\"><soap:Header><context xmlns=\"urn:zimbra\"><userAgent name=\"ZimbraWebClient - SAF3 (Win)\" version=\"5.0.15_GA_2851.RHEL5_64\"/></context></soap:Header><soap:Body><AuthRequest xmlns=\"urn:zimbraAdmin\"><account by=\"adminName\">zimbra</account><password>ldDR6b_j1</password></AuthRequest></soap:Body></soap:Envelope>'  'https://127.0.0.1:7071/service/admin/soap' -v
